{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "Model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 341, 513, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}, "name": "time_distributed", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn1", "trainable": true, "dtype": "float32", "nb_filters": 20, "kernel_size": 6, "nb_stacks": 2, "dilations": [1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 16384], "padding": "same", "use_skip_connections": false, "dropout_rate": 0.05, "return_sequences": false, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn1", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["tcn1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["categorical_accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [20], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [20], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [20], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [20], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 3, 2, 32], "dtype": "float32"}, {"name": "conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [20, 10], "dtype": "float32"}, {"name": "dense/bias", "shape": [10], "dtype": "float32"}, {"name": "tcn1/residual_block_0/conv1D_0/kernel", "shape": [6, 8224, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_0/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_0/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_0/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_0/matching_conv1D/kernel", "shape": [1, 8224, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_0/matching_conv1D/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_1/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_1/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_1/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_1/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_2/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_2/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_2/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_2/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_3/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_3/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_3/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_3/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_4/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_4/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_4/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_4/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_5/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_5/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_5/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_5/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_6/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_6/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_6/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_6/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_7/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_7/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_7/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_7/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_8/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_8/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_8/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_8/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_9/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_9/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_9/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_9/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_10/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_10/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_10/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_10/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_11/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_11/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_11/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_11/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_12/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_12/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_12/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_12/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_13/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_13/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_13/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_13/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_14/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_14/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_14/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_14/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_15/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_15/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_15/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_15/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_16/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_16/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_16/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_16/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_17/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_17/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_17/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_17/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_18/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_18/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_18/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_18/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_19/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_19/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_19/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_19/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_20/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_20/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_20/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_20/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_21/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_21/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_21/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_21/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_22/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_22/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_22/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_22/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_23/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_23/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_23/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_23/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_24/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_24/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_24/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_24/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_25/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_25/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_25/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_25/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_26/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_26/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_26/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_26/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_27/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_27/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_27/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_27/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_28/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_28/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_28/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_28/conv1D_1/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_29/conv1D_0/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_29/conv1D_0/bias", "shape": [20], "dtype": "float32"}, {"name": "tcn1/residual_block_29/conv1D_1/kernel", "shape": [6, 20, 20], "dtype": "float32"}, {"name": "tcn1/residual_block_29/conv1D_1/bias", "shape": [20], "dtype": "float32"}]}]}
